[
    {
        "name": "Mazumdar-Shaw-Medical-Centre-Bommasandra-Bangalore",
        "address": "\n                            258-A, Bommasandra Industrial Area, Behind Narayana Hrudayala, Anekal, Bengaluru 562106, KA",
        "contact": "\n+91-080-67506820",
        "reviews": [
            {
                "comment": "Doctor is very listening, Very much helpful. We are satisfied. Thank you Madhurta for your help. All are really very good. ",
                "rating": 5
            },
            {
                "comment": "Very nice doctor.behaviour is good.i am satisfied. Thank you Madhurta for your co operation.thank you Majumdar Shaw medical center.I am satisfied really ",
                "rating": 5
            },
            {
                "comment": "Everyone's behaviour  is very good.all are Very helpful really.doctors are also very careful, helpful.they are god really & thnks to you Madhurta In Gastroenterology department. You helped us very nicely.We are very much satisfied for all.thanks to all again. ",
                "rating": 5
            },
            {
                "comment": "Doctor's behaviour  is very Good. We are satisfied. I came here with my husband for the 1st time.U people helped us very much.Thank you Madhurta (Gastroenterology department) U are really very helpful person.This hospital is really very nice, peaceful, helpful also.doctors are Very carefull for all patient.we came here from Bangladesh.satisfied we are.thank you MSMC. ",
                "rating": 5
            },
            {
                "comment": "We are very old patients here .Madhurta thank you so much.you behaviour is very good, you helps us alot today.hospital facilities also very much good.doctor is also very good.we are satisfied. ",
                "rating": 5
            },
            {
                "comment": "Good treatment and services are very good and also doctor very cooperative and patient care coordinator are very good ",
                "rating": 5
            },
            {
                "comment": "At here Service is very good we r lightly satisfid but we r bengali patient 80%, we need bengali translator in every Doctor's  room.then it will be very helpfull for us.in every Department  we need 1 bengali patient care co ordinator.Thank you Madhurta, you help us very much in Gastro department today.next time we will come again.All over is very nice.some doctor's  secretary's behaviour  is very bad... ",
                "rating": 5
            },
            {
                "comment": "Nice haspital best treatment and doctors are good    patient care coordinator are helping great thank you ",
                "rating": 5
            },
            {
                "comment": "Mazumdar Shaw haspital is good and doctor treatment is good we happy with service and staff thank you ... ",
                "rating": 5
            },
            {
                "comment": "Gud hospital the patient care co ordinator are gud they helps lot in hospital and good treatment thank you so much for your help... ",
                "rating": 5
            },
            {
                "comment": "Good service..... Patient care coordinator is helping very well thank you so much for your help .... ",
                "rating": 5
            },
            {
                "comment": "Good haspital  good facility good service everything is excellent doctor treatment are good....???????? ",
                "rating": 5
            },
            {
                "comment": "It is very good for our health, there are a lot of benefits it you will be healthy people also believe that the first happiness is good ",
                "rating": 5
            },
            {
                "comment": "Good services and good treatment.. Thank you so much... Such good hospitality patient care come ordinater are helping great I feel happy ",
                "rating": 5
            },
            {
                "comment": "Very nice hospital and staff are very co-operative and doctors are best here overall I m very satisfied with the service. ",
                "rating": 5
            },
            {
                "comment": "Very good hospital as well as staff , doctors are nice overall I m satisfied with the service will recommend to my friend as well ",
                "rating": 5
            },
            {
                "comment": "Very good hospital and staff are also very co-operative as well as doctors are also very nice i m overall satisfied. ",
                "rating": 5
            },
            {
                "comment": "Very good hospital nd staff are supportive especially Pcc Ms priyanka and doctor was also very good. ",
                "rating": 5
            },
            {
                "comment": "The doctors and the treatment is very good. But few supporting staffs ( in OPD ) bahavior  are not good at all. Without listening anything, directly they are asking go and payment. In my case, when I asked to doctor, he told no need to pay as i had paid full payment just 3 days before and this is kind of follow up after surgery. So, the staffs should understand and then ask for money If it is really after the free consultation duration. ",
                "rating": 3
            },
            {
                "comment": "They are the excellent team and well professionals for squeezing money from the patients. Thay are littrely bugging for the money even you have insurance coverage. One admission minimum you need to pay 20k simply as deposit. It is a clear cut case of pakka bussiness. Its starting from parking till doctors. One of the worst experiance I ever expect. They have a excellent team in labour room, surgical ICU. The securiry, ward, billing, insurance are doing experiment to making others job put in tose.No proper communication, miss behaviour of ward nurse. No quality aminities, no cleanness,  even u pay 2lcs or more. Its better to go any govt hospital. ",
                "rating": 3
            }
        ]
    },
    {
        "name": "Manipal-Hospital-Kodihalli-Bangalore",
        "address": "\n                            98, HAL Airport Road, Kodihalli, Bengaluru 560017, KA",
        "contact": "\n+91-80-46684506",
        "reviews": [
            {
                "comment": "Had gone for doc consultation for my son for cough on a saturday. Doc suggested xray, ultrasound, blood tests and gave some meds. Total cost came to around 8k. Reports wil be available only after 2 hours and will be emailed, we were told.By Tues, there was no email.I tried calling but never went beyond automated message.They kept putting me in caller queue.No call back.Finally, went to hospital again, got reports. Was asked to pay 200 Rs again to show the reports for which I hav paid 8k 2 days back. When enquired with customer care as to y i was being charged to show reports of tests prescribed and done at their hospital, the guy had no answers. Sad state of money making from desperation of people. ",
                "rating": 3
            },
            {
                "comment": "I came here for knee replacement of my mother. Dr is good Management is very poor. Nurses have not updated the food requirements. She has not been given anything till 6 pm . If we are not following up no movement from staff. My mother's bp is 150+ from last night. It has been 14 hours , no doctor has been visited. Seems like a joke , noone knows anything. Nurses don't know when doctor will come . Don't know who knows . Cannot change hospital in bw. Don't know what to do. ",
                "rating": 1
            },
            {
                "comment": "We have been visiting Manipal Hospital for our son treatment  . we are extremely Thankful to Dr Usha Mallinath for her care towards the child. child is doing well . She is an wonderful doctor and took good care of our child ",
                "rating": 5
            },
            {
                "comment": "Very bad experience with manipal Went for treatment for my 3 ysrs kid But there is no value for patient condition and life They will keep on doing blood test even for small disease due to which I suffered a lot and lost my son who was having very small disease No proper treatment no staff coordination No proper doctor who can understand the real  cause for disease ",
                "rating": 1
            },
            {
                "comment": "Worst experience, this is not the way to treat patients, please be nice to patients, the way staff treat patients is worst and rude ",
                "rating": 1
            },
            {
                "comment": "I had very bad experience with the dr., she is so snobbish plus my daughter has suffered for three months because of wrong treatment given by her.she is not at all fit to be a doctor. ",
                "rating": 3
            },
            {
                "comment": "Very bad experience with all management structure. no coordination nothing. if you go there it will take ages to get a report. the support staff thinks they are god and they will treat u like some cats ans dogs ",
                "rating": 1
            },
            {
                "comment": "Will update it soon after I get discharge from here. Have lot of points to share with you guys. Watch out this space ",
                "rating": 1
            },
            {
                "comment": "I had taken my mother for comprehensive health checkup at Manipal hospital l, Jayanagar. The whole process is very well organised and hassle free. Nurse Sudharani was very supportive and helped us right from giving samples, getting report and consultation. We are very much satisfied with the whole package, process and appreciate the support given by nurse Sudharanii ",
                "rating": 5
            },
            {
                "comment": "We have received the best nephrology care from renal transplant team. Thank you experts doctors and nursing team . From Mr Sujeeth kumar . ",
                "rating": 5
            },
            {
                "comment": "For last 6 months or so I was in severe chronic neck pain radiating into hands due to which my sleep was never comfortable. I was advised by my husband to see Dr. Adiga. As usual the doctor was down to earth, listened patiently to my issues and  bang on clinically diagnosed for neck / shoulder spasm without unnecessary MRI/X-rays and directed me for physiotherapy. Mr. Anand physiotherapist is a through professional, excellent knowledge and caring person . From the very first day he demonstrated excellent medical knowledge and dexterity to treat my condition.  I could feel the relief from the first day and within a week my condition improved drastically. His assurance that I will be alright within a week gave me immense courage and  I have no words to thank him. I was so lucky to find you Anand. I strong recommend for patients suffering from chronic ",
                "rating": 5
            },
            {
                "comment": "I was tested + ve and have chosen Manipal hospital home isolation package. Staff head nurse Sandhiya is extremely dedicated and very supportive and very helpful. My special kudos to Sandhiya for her dedicated service. ",
                "rating": 5
            },
            {
                "comment": "Please don't visit Manipal Hospital, Whitefield if you value your time and self respect I have had the worst experience at Manipal Hospital, Whitefield today. I had booked myself for Covid Vaccination THROUGH MANIPAL HOSPITAL APP for 10:05 today. had assumed that having booked a particular time, the hospital will uphold the commitment of time and do the necessary with a mild delay(if any). I had also paid online for the same thus making the work easier for the hospital. Had reached at 10:00 to see complete confusion here and no one to guide on the process. Post running around, got the form filled and was asked to wait(at 10:10). it is 11:30 now and I am still waiting to be called. This seems to be the height of unprofessionalism, am surprised that such an institution is acting this way. Moreover, had to receive some rude answers \"if you can wait good, else come some other day\" by the lady managing the setup. Approached the admin head resulting in just nice useless words and further waiting. The issue is there is no value given for people’s time and feelings. The last 90 minutes, have seen many senior citizens getting agitated by the treatment given by the staff. To make matters worse, a gentleman and his wife who knew a doctor here, walked in and walked out within 10 min. I have been associated with Manipal hospitals for over 20 years now and am regretting the association. The hospital staff should learn how to manage people / processes and most importantly abstain from being rude. Overall a shameful experience. ",
                "rating": 1
            },
            {
                "comment": "Good environment with good team members of health check up in your Hospital love to work in your Hospital ",
                "rating": 4
            },
            {
                "comment": "Manipal Hal hospital is giving me scared and worst experience. I never expect this from one reputed hospital. There is no value for human life. If you want live long don't choose this hospital. On May  me and my husband visited hospital for my husband had tumor in his bile. One of my nearest Dr. Suggested this hospital. Due to Covid situation I can't take him to my native. So we started treating in Manipal by believing the Doctors and the Hospital. He got Jaundice also in that time. So treatment was essential. What ever the Doctor said I just followed that. One day just to fix the stent he admitted in hospital. After that fixed Surgery on August 10. 2020. My husband was fully active in that time he was driving the vehicle. After  surgery (Whipple procedure). He became very tired and day by day got wait lost. He was not fully recovery yet also Doctor told to discharge. After went home with in ten days again got admitted bcz of more leakage from surgery area. Even he can't eat food 4 months used to give through the stomach tube that also only liquid.  We was in hospital for 14 days. After one month again he admitted doctor told will start TPN. To improve his body wait only 2 days admission is required. I want to see him healthy so he got admitted. Once the TPN started he was getting lot of side effects. And also the was giving insulin for daibatic. Bcz of these two he turned to brain strock. After two days he was not able to talk and moove.  We was in hospital for 8 days doctors told he is not responding for medicine. Now my husband is  no more at the age of 47. Very wurst Doctors and some nurses. I don't want reveal the doctors (nurses) name.But I will tell one thing that devils killed my husband. ",
                "rating": 1
            },
            {
                "comment": "We are very thankful to Dr Karthik Nagesh to have treated our young infant daughter with complications related to Covid related issues with multiple organ discfuntion. He has given a new lease of life to our child and we are very grateful and thankfully to you. ",
                "rating": 5
            },
            {
                "comment": "I have visited Dr.Rita Mukherjee from Dental department couple of year back to fix a bridge.So she suggested me to go for permanent fixation which comes with a warranty of 10 years but the charges will be high.But agreed to it as it was for lifetime.But in a time of 2 yrs the bridge came out and called up the call hospital and stated the issue hearing that the lady hung up the call pretending my voice is inaudible.But I kept trying the number and managed to get an appointment with Dr.Rita Mukherjee.So looking at my teeth she said I think we had done a temporary cementing because permanent ones doesn’t come out but luckily I had the warranty card with me so looking at that she realized it’s her mistake so now she was trying to find the mistake in the card by saying it was valid til last month but again I calculated and showed her that we still have 1 more year to go.So now she understood that hospital won’t be able to make money as it was under warranty so she did not take any interest and asked her novice assistant to do the cementing and she left from there saying she has to go for COVID first shot.The assistant of hers struggled and managed to fix my bridge with zero professionalism.And later he asked me to pay at reception and I paid again thinking it’s ok but logically shouldn’t have.The next I see my bridge again in my hand I was so irritated again but felt it’s a utter waste going again to these people.Big frauds.Do not recommend at all ",
                "rating": 1
            },
            {
                "comment": "We apparently were new into the premises of the hospital andwere visiting the pulmonology department for my sister lung care, where everything was quite smooth except a little bit long waiting for all the procedures, But one sister in IR dept was so rude in answering after making us wait a good 15 mins without giving proper answer. Once we enquired again and again we were directed to the same doctor back for admission saying, it's already told to go back to same doctor for further procedure. Anyway I really wonder how are people keep coming back to place like this , where people like this sister work who is supposed to be little courteous to people who come for getting treated, it's paid too, not a free service though. ",
                "rating": 1
            },
            {
                "comment": "My newborn grandson had severe infection with low blood pressure. He was transferred from another hospital in a very critical condition to the Neonatal department of Manipal hospital under the care of Dr Karthik Nagesh. We would like to thank you and and your team for the great attention and prompt action rendered. Once again my heartiest thanks to everyone in your team for their support during my  hard time. My heartbeats getting back to rhythm slowly, longway to-go. ",
                "rating": 5
            },
            {
                "comment": "Good support from pcc Vignesh in 7th Ab floor.. management n discipline was good ., ...............good n caring staffs....... ",
                "rating": 3
            }
        ]
    }
]